[
    {
        "pid": 14,
        "title": "All graph state verification protocols are composably secure",
        "abstract": "Graph state verification protocols allow multiple parties to share a graph state while checking that the state is honestly prepared, even in the presence of malicious parties. Since graph states are the starting point of numerous quantum protocols, it is crucial to ensure that graph state verification protocols can safely be composed with other protocols, this property being known as composable security. Previous works conjectured that such a property could not be proven within the abstract cryptography framework: we disprove this conjecture by showing that all graph state verification protocols can be turned into a composably secure protocol with respect to the natural functionality for graph state preparation. Moreover, we show that any unchanged graph state verification protocol can also be considered as composably secure for a slightly different, yet useful, functionality. Finally, we show that these two results are optimal, in the sense that any such generic result, considering arbitrary black-box protocols, must either modify the protocol or consider a different functionality. Along the way, we show a protocol to generalize entanglement swapping to arbitrary graph states that might be of independent interest.",
        "authors": [
            {
                "first": "Léo",
                "last": "Colisson",
                "affiliation": "CWI/QuSoft, Amsterdam"
            },
            {
                "first": "Damian",
                "last": "Markham",
                "affiliation": "CNRS"
            },
            {
                "first": "Raja",
                "last": "Yehia",
                "affiliation": "ICFO"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 18,
        "title": "A fast and robust quantum random number generator with a self-contained integrated photonic randomness core",
        "abstract": "Random numbers play a crucial role in information technology, particularly as digital communication capacity continues to expand. Consequently, the need for secure and high-rate random number generation has become increasingly urgent.  While integrated photonics technology holds promise for mass-producing optoelectronic quantum random number generators (QRNGs), there remains a challenge in developing fast, robust, and scalable solutions suitable for industrial deployment. Addressing this challenge, we present a fast QRNG solution in this study, leveraging a photonic integrated circuit (PIC) directly embedded onto a versatile electronic platform.  Designed to withstand real-world applications, our PIC is packaged to align with industrial electronic assembly lines.  To rigorously assess scalability and stability, these generators underwent week-long periods of continuous GHz operation.  Furthermore, a QRNG was integrated into a quantum key distribution system, where despite operating in an uncontrolled environment, minimal variations in physical randomness were observed over 38 days, as measured from 2.9 million histograms. Finally, we implemented a security model for the QRNGs, enabling rate adjustment to match the actual randomness content and demonstrating secure generation at 2 Gbit/s.",
        "authors": [
            {
                "first": "Davide G.",
                "last": "Marangon",
                "affiliation": "Department of Engineering of Information, University of Padova"
            },
            {
                "first": "Peter Raymond",
                "last": "Smith",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Nathan",
                "last": "Walk",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Taofiq",
                "last": "Paraiso",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "James F.",
                "last": "Dynes",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Victor",
                "last": "Lovic",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Mirko",
                "last": "Sanzaro",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Thomas",
                "last": "Roger",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Innocenzo De",
                "last": "Marco",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Marco",
                "last": "Lucamarini",
                "affiliation": "Department of Physics and York Centre for Quantum Technologies, University of York"
            },
            {
                "first": "Zhiliang",
                "last": "Yuan",
                "affiliation": "Toshiba Research Europe Limited"
            },
            {
                "first": "Andrew J.",
                "last": "Shields",
                "affiliation": "Toshiba Research Europe Limited"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 20,
        "title": "Conditional disclosure of secrets with quantum resources",
        "abstract": "The conditional disclosure of secrets (CDS) primitive is among the simplest cryptographic settings in which to study the relationship between communication, randomness, and security. CDS involves two parties, Alice and Bob, who do not communicate but who wish to reveal a secret $z$ to a referee if and only if a Boolean function $f$ has $f(x,y)=1$. Alice knows $x,z$, Bob knows $y$, and the referee knows $x,y$. Recently, a quantum analogue of this primitive called CDQS was defined and related to $f$-routing, a task studied in the context of quantum position-verification. CDQS has the same inputs, outputs, and communication pattern as CDS but allows the use of shared entanglement and quantum messages. We initiate the systematic study of CDQS, with the aim of better understanding the relationship between privacy and quantum resources in the information theoretic setting.  Following the classical literature on CDS for guidance, we establish closure under negation, an amplification property, and prove a number of lower bounds on CDQS based on communication complexity.",
        "authors": [
            {
                "first": "Alex",
                "last": "May",
                "affiliation": "Institute for Quantum Computing and Perimeter Institute for Theoretical Physics, Waterloo"
            },
            {
                "first": "Vahid Reza",
                "last": "Asadi",
                "affiliation": "University of Waterloo"
            },
            {
                "first": "Kohdai",
                "last": "Kuroiwa",
                "affiliation": "Institute for Quantum Computing and Perimeter Institute for Theoretical Physics, Waterloo"
            },
            {
                "first": "Debbie",
                "last": "Leung",
                "affiliation": "Institute for Quantum Computing and Perimeter Institute for Theoretical Physics, Waterloo"
            },
            {
                "first": "Sabrina",
                "last": "Pasterski",
                "affiliation": "Perimeter Institute for Theoretical Physics, Waterloo"
            },
            {
                "first": "Chris",
                "last": "Waddell",
                "affiliation": "Perimeter Institute for Theoretical Physics, Waterloo"
            }
        ],
        "topics": [
        ],
        "mergedwith": 96
    },
    {
        "pid": 23,
        "title": "Making Existing Quantum Position Verification Protocols Secure Against Arbitrary Transmission Loss",
        "abstract": "Signal loss poses a significant threat to the security of quantum cryptography when the chosen protocol lacks loss-tolerance. In quantum position verification (QPV) protocols, even relatively small loss rates can compromise security. The goal is thus to find protocols that remain secure under practically achievable loss rates. In this work, we modify the usual structure of QPV protocols and prove that this modification makes the potentially high transmission loss between the verifiers and the prover security-irrelevant for a class of protocols that includes a practically-interesting candidate protocol inspired by the BB84 protocol. This modification, which involves photon presence detection, a small time delay at the prover, and a commitment to play before proceeding, reduces the overall loss rate to just the prover’s laboratory. The adapted protocol then becomes a practically feasible QPV protocol with strong security guarantees, even against attackers using adaptive strategies. As the loss rate between the verifiers and prover is mainly dictated by the distance between them, secure QPV over longer distances becomes possible. We also show possible implementations of the required photon presence detection, making the adapted  protocol a protocol that solves all major practical issues in QPV. Finally, we discuss experimental aspects and give parameter estimations.",
        "authors": [
            {
                "first": "Rene",
                "last": "Allerstorfer",
                "affiliation": "QuSoft (CWI Amsterdam)"
            },
            {
                "first": "Andreas",
                "last": "Bluhm",
                "affiliation": "Univ. Grenoble Alpes, CNRS, Grenoble INP, LIG"
            },
            {
                "first": "Harry",
                "last": "Buhrman",
                "affiliation": "QuSoft, CWI Amsterdam, University of Amsterdam"
            },
            {
                "first": "Matthias",
                "last": "Christandl",
                "affiliation": "University of Copenhagen"
            },
            {
                "first": "Llorenç",
                "last": "Escolà-Farràs",
                "affiliation": "QuSoft, CWI Amsterdam, University of Amsterdam"
            },
            {
                "first": "Florian",
                "last": "Speelman",
                "affiliation": "QuSoft, University of Amsterdam"
            },
            {
                "first": "Philip Verduyn",
                "last": "Lunel",
                "affiliation": "QuSoft (CWI Amsterdam)"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 24,
        "title": "On the composable security of weak coin flipping",
        "abstract": "Weak coin flipping is a cryptographic primitive in which two mutually distrustful parties generate a shared random bit to agree on a winner via remote communication. While a stand-alone secure weak coin flipping protocol can be constructed from noiseless communication channels, its composability has not been explored. In this work, we demonstrate that no weak coin flipping protocol can be abstracted into a black box resource with composable security. Despite this, we also establish the overall stand-alone security of weak coin flipping protocols under sequential composition.",
        "authors": [
            {
                "first": "Jiawei",
                "last": "Wu",
                "affiliation": "National University of Singapore"
            },
            {
                "first": "Yanglin",
                "last": "Hu",
                "affiliation": "National University of Singapore"
            },
            {
                "first": "Akshay",
                "last": "Bansal",
                "affiliation": "Virginia Tech"
            },
            {
                "first": "Marco",
                "last": "Tomamichel",
                "affiliation": "National University of Singapore"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 31,
        "title": "Hacking twin-field quantum key distribution via wavelength-switching attack",
        "abstract": "The twin-field class quantum key distribution (TF-class QKD) has experimentally demonstrated the ability to surpass the fundamental rate-distance limit without requiring a quantum repeater, as a revolutional milestone. In TF-class QKD implementation, an optical phase-locked loop (OPLL) structure is commonly employed to generate a reference light with correlated phase, ensuring coherence of optical fields between Alice and Bob. In this configuration, the reference light, typically located in the untrusted station Charlie, solely provides wavelength reference for OPLL and does not participate in quantum-state encoding. However, the reference light may open a door for Eve to enter the source stations that are supposed to be well protected. Here, by identifying vulnerabilities in the OPLL scheme, we propose and demonstrate a wavelength-switching attack on a TF-class QKD system. This attack involves Eve deliberately manipulating the wavelength of the reference light to increase mean photon number of prepared quantum states, while maintaining stable interference between Alice and Bob as required by TF-class QKD protocols. The maximum observed increase in mean photon number is 8.7%, which has been theoretically proven to compromise the security of a TF-class QKD system. Through this study, we disclose security vulnerabilities associated with TF-class QKD implementation and provide valuable insights into its practical security.",
        "authors": [
            {
                "first": "Peng",
                "last": "Qingqian",
                "affiliation": "National University of Defense Technology"
            },
            {
                "first": "Chen",
                "last": "Jiupeng",
                "affiliation": "Jinan Institute of Quantum Technology"
            },
            {
                "first": "Xing",
                "last": "Tianyi",
                "affiliation": "National University of Defense Technology"
            },
            {
                "first": "Wang",
                "last": "Dongyang",
                "affiliation": "National University of Defense Technology"
            },
            {
                "first": "Wang",
                "last": "Yizhi",
                "affiliation": "National University of Defense Technology"
            },
            {
                "first": "Ying",
                "last": "Guo",
                "affiliation": "Beijing University of Posts and Telecommunications"
            },
            {
                "first": "Liu",
                "last": "Yang",
                "affiliation": "Jinan Institute of Quantum Technology"
            },
            {
                "first": "Huang",
                "last": "Anqi",
                "affiliation": "National University of Defense Technology"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 37,
        "title": "Security Proof for Variable-Length Quantum Key Distribution",
        "abstract": "We present a security proof for variable-length QKD against IID collective attacks. Our proof can be lifted to coherent attacks using the postselection technique. Our first main result is a theorem to convert a sequence of security proofs for fixed-length protocols satisfying certain conditions to a security proof for a variable-length protocol. This conversion requires no new calculations, does not require any changes to the final key lengths or the amount of error-correction information, and at most doubles the  security parameter.  Our second main result is the description and security proof of a more general class of variable-length QKD protocols, which does not require characterizing the honest behaviour of the channel connecting the users before the execution of the QKD protocol. Instead, these protocols adaptively determine the length of the final key, and the amount of information to be used for error-correction, based upon the observations made during the protocol. We apply these results to the qubit BB84 protocol, and show that variable-length implementations lead to higher expected key rates than the fixed-length implementations. Finally, we point out a critical flaw in the analysis of privacy amplification that arises due to sifting. We provide an elegant solution that retroactively fixes this flaw.",
        "authors": [
            {
                "first": "Devashish",
                "last": "Tupkary",
                "affiliation": "Institute for Quantum Computing"
            },
            {
                "first": "Ernest Y.-Z.",
                "last": "Tan",
                "affiliation": "Institute for Quantum Computing"
            },
            {
                "first": "Norbert",
                "last": "Lütkenhaus",
                "affiliation": "Institute for Quantum Computing"
            }
        ],
        "topics": [
        ],
        "mergedwith": 38
    },
    {
        "pid": 38,
        "title": "Variable-length QKD security proof for imperfect detectors through phase-error estimation",
        "abstract": "Security proofs for quantum key distribution (QKD) based on the entropic uncertainty relations and the phase-error approach have the advantage of producing some of the tightest key rates against coherent attacks.  We prove the security of QKD using the entropic uncertainty relations, for scenarios where Eve is allowed full control of the detection efficiency and dark rates of all detectors within some specified ranges. Thus, our work solves the practically important problem of detector side channels. Our work also removes the requirement of  ``basis-independent loss'' required by these proof techniques. Thus, we render these proof techniques applicable to practical QKD scenarios. Furthermore, we prove security for variable-length QKD protocols, which do not require Alice and Bob to characterize the honest behaviour of the channel.",
        "authors": [
            {
                "first": "Devashish",
                "last": "Tupkary",
                "affiliation": "Institute for Quantum Computing"
            },
            {
                "first": "Shlok",
                "last": "Nahar",
                "affiliation": "Institute for Quantum Computing"
            },
            {
                "first": "Pulkit",
                "last": "Sinha",
                "affiliation": "Institute for Quantum Computing"
            },
            {
                "first": "Norbert",
                "last": "Lutkenhaus",
                "affiliation": "Institute for Quantum Computing"
            }
        ],
        "topics": [
        ],
        "mergedwith": 37
    },
    {
        "pid": 42,
        "title": "Tighter concentration inequalities for quantum adversarial setups exploiting permutation symmetry",
        "abstract": "We developed new concentration inequalities for a quantum state on an N -qudit system or measurement outcomes on it that apply to an adversarial setup, where an adversary prepares the quantum state. Our one-sided concentration inequalities for a quantum state require the N -qudit system to be permutation invariant and are thus de-Finetti type, but they are tighter than the one previously obtained. We show that the bound can further be tightened if each qudit system has an additional symmetry. Furthermore, our concentration inequality for the outcomes of independent and identical measurements on an N -qudit quantum system has no assumption on the adversarial quantum state and is much tighter than the conventional one obtained through Azuma’s inequality. We numerically demonstrate the tightness of our bounds in simple quantum information processing tasks.",
        "authors": [
            {
                "first": "Takaya",
                "last": "Matsuura",
                "affiliation": "RMIT University"
            },
            {
                "first": "Shinichiro",
                "last": "Yamano",
                "affiliation": "The University of Tokyo"
            },
            {
                "first": "Yui",
                "last": "Kuramochi",
                "affiliation": "Kyushu University"
            },
            {
                "first": "Toshihiko",
                "last": "Sasaki",
                "affiliation": "The University of Tokyo"
            },
            {
                "first": "Masato",
                "last": "Koashi",
                "affiliation": "The University of Tokyo"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 43,
        "title": "Decoy state quantum key distribution for practical single-photon sources",
        "abstract": "High brightness, low second-order correlation function single-photon sources (SPSs) are an alternative to commonly employed weak coherent pulse (WCP) sources for discrete variable quantum key distribution (QKD) and offer potential key-rate and finite-block scaling advantages. However, the loss tolerance of SPS-based QKD is compromised by photon number splitting (PNS) attacks against non-negligible multiphoton emissions. Decoy state (DS) techniques mitigate against PNS attacks, with WCP-DS QKD over several hundred km in fibre being demonstrated. DS QKD protocols for different source photon number statistics have been proposed, such as for binomial and thermal distributions. Here, we investigate the use of generalised DS techniques assuming we do not have access to the true photon number statistics of the SPS. Thus, we bound the source distribution using the mean photon number and the second-order correlation function, which provides us with enough partial knowledge to compute our decoy SPS protocols. Hence, we provide finite-key security bounds for an SPS-based Efficient BB84 for several decoy protocols with optimised parameters, and derive required SPS characteristics to achieve a key rate enhancement over DS WCPs and match their loss tolerance.",
        "authors": [
            {
                "first": "Roberto",
                "last": "Pousa",
                "affiliation": "University of Strathclyde"
            },
            {
                "first": "Daniel",
                "last": "Oi",
                "affiliation": "University of Strathclyde"
            },
            {
                "first": "John",
                "last": "Jeffers",
                "affiliation": "University of Strathclyde"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 47,
        "title": "Implementation of mode-pairing quantum key distribution in inter-city networks",
        "abstract": "Quantum key distribution is a cornerstone of quantum technology, offering information-theoretical secure keys for remote parties. With many quantum communication networks established globally, the mode-pairing protocol stands out for its efficacy over inter-city distances using simple setups, emerging as a promising solution.  In this study, we employ the mode-pairing scheme into existing inter-city fiber links, conducting field tests across distances ranging from tens to about a hundred kilometers. Our system achieves a key rate of $1.217$ kbit/s in a $195.85$ km symmetric link and $3.089$ kbit/s in a $127.92$ km asymmetric link without global phase locking. The results demonstrate that the mode-pairing protocol can achieve key rates comparable to those of a single quantum link between two trusted nodes on the Beijing-Shanghai backbone line, effectively reducing the need for half of the trusted nodes. These field tests confirm the mode-pairing scheme's adaptability, efficiency, and practicality, positioning it as a highly suitable protocol for quantum networks.",
        "authors": [
            {
                "first": "Yizhi",
                "last": "Huang",
                "affiliation": "Center for Quantum Information, Institute for Interdisciplinary Information Sciences, Tsinghua University"
            },
            {
                "first": "Hao-Tao",
                "last": "Zhu",
                "affiliation": "Hefei National Laboratory, University of Science and Technology of China, Hefei"
            },
            {
                "first": "Wen-Xin",
                "last": "Pan",
                "affiliation": "Hefei National Laboratory, University of Science and Technology of China, Hefei"
            },
            {
                "first": "Chao-Wu",
                "last": "Zhou",
                "affiliation": "Hefei National Laboratory, University of Science and Technology of China, Hefei"
            },
            {
                "first": "Mi",
                "last": "Zou",
                "affiliation": "Hefei National Laboratory, University of Science and Technology of China"
            },
            {
                "first": "Shibiao",
                "last": "Tang",
                "affiliation": "QuantumCTek Corporation Limited, Hefei"
            },
            {
                "first": "Xiongfeng",
                "last": "Ma",
                "affiliation": "Center for Quantum Information, Institute for Interdisciplinary Information Sciences, Tsinghua University"
            },
            {
                "first": "Teng-Yun",
                "last": "Chen",
                "affiliation": "Hefei National Laboratory, University of Science and Technology of China, Hefei"
            },
            {
                "first": "and Jian-Wei",
                "last": "Pan",
                "affiliation": "Hefei National Laboratory, University of Science and Technology of China, Hefei"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 55,
        "title": "Security of hybrid BB84 with heterodyne detection",
        "abstract": "Quantum key distribution (QKD) promises everlasting security based on the laws of physics. Most common protocols are grouped into two distinct categories based on the degrees of freedom used to carry information, which can be either discrete or continuous, each presenting unique advantages in either performance, feasibility for near-term implementation, and compatibility with existing telecommunications architectures. Recently, hybrid QKD protocols have been introduced to leverage advantages from both categories. In this work we provide a rigorous security proof for a protocol introduced by Qi in 2021, where information is encoded in discrete variables as in the widespread Bennett Brassard 1984 (BB84) protocol but decoded continuously via heterodyne detection. Security proofs for hybrid protocols inherit the same challenges associated with continuous-variable protocols due to unbounded dimensions. Here we successfully address these challenges by exploiting symmetry. Our approach enables truncation of the Hilbert space with precise control of the approximation errors and lead to a tight, semi-analytical expression for the asymptotic key rate under collective attacks. As concrete examples, we apply our theory to compute the key rates under passive attacks, linear loss, and Gaussian noise.",
        "authors": [
            {
                "first": "Jasminder",
                "last": "Sidhu",
                "affiliation": "University of Strathclyde"
            },
            {
                "first": "Rocco",
                "last": "Maggi",
                "affiliation": "Politecnico di Bari"
            },
            {
                "first": "Saverio",
                "last": "Pascazio",
                "affiliation": "Universita di Bari"
            },
            {
                "first": "Cosmo",
                "last": "Lupo",
                "affiliation": "Politecnico di Bari"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 56,
        "title": "High-speed Heterodyne-based Quantum Random Number Generator on a Chip",
        "abstract": "A wide range of applications require, by hypothesis, to have access to a private and genuine random source. Quantum Random Number Generators (QRNGs) are currently the sole technology capable of producing true randomness. Nevertheless, other factors must be considered when addressing real-world use cases, and the bulkiness of current implementations significantly limits their adoption. In this work, we present a high-performance source-device independent QRNG leveraging a custom-made integrated silicon photonic chip. The proposed scheme exploits the properties of a heterodyne receiver to enhance security and integration to promote spatial footprint reduction while simplifying its implementation. Such characteristics could represent a significant advancement toward the development of generators better suited to meet the demands of portable and space applications. Indeed, the system can deliver secure random numbers at a rate greater than 20 Gbps with a reduced encumbrance.",
        "authors": [
            {
                "first": "Tommaso",
                "last": "Bertapelle",
                "affiliation": "Università degli Studi di Padova"
            },
            {
                "first": "Marco",
                "last": "Avesani",
                "affiliation": "Università degli Studi di Padova"
            },
            {
                "first": "Alberto",
                "last": "Montanaro",
                "affiliation": "Scuola Superiore Sant’Anna"
            },
            {
                "first": "Massimo",
                "last": "Artiglia",
                "affiliation": "Scuola Superiore Sant’Anna"
            },
            {
                "first": "Francesco",
                "last": "Testa",
                "affiliation": "Scuola Superiore Sant’Anna"
            },
            {
                "first": "Gabriele De",
                "last": "Angelis",
                "affiliation": "Scuola Superiore Sant’Anna"
            },
            {
                "first": "Giampiero",
                "last": "Contestabile",
                "affiliation": "Scuola Superiore Sant’Anna"
            },
            {
                "first": "Giuseppe",
                "last": "Vallone",
                "affiliation": "Università degli Studi di Padova"
            },
            {
                "first": "Paolo",
                "last": "Villoresi",
                "affiliation": "Università degli Studi di Padova"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 69,
        "title": "28-pixel parallel SNSPDs with low jitter at high detection rates for high-speed quantum communication",
        "abstract": "We report the fabrication and characterization of 28-pixel P-SNSPD, reaching 88% system detection efficiency (SDE) at the single photon level. The detector is able to detect single-photon events at 250 Mcps with 50% nominal SDE, using only a single coaxial read-out cable, and maintains a timing jitter below 80 ps until 200 Mcps. Moreover,we achieve 1 Gcps detection rates by using only 4 P-SNSPD detectors and an 1:4 commercially available optical splitter Finally, we show how the P-SNSPD architecture allows us to maintain a very low jitter even at the high detection rates. We finally analyze the PNR capability of the array and measure efficiencies of 75% at 2-photon and 60% at 3-photon at 1550nm.",
        "authors": [
            {
                "first": "Lorenzo",
                "last": "Stasi",
                "affiliation": "ID Quantique SA and Group of Applied Physics, University of Geneva"
            },
            {
                "first": "Towsif",
                "last": "Taher",
                "affiliation": "Group of Applied Physics, University of Geneva"
            },
            {
                "first": "Giovanni V.",
                "last": "Resta",
                "affiliation": "ID Quantique SA"
            },
            {
                "first": "Hugo",
                "last": "Zbinden",
                "affiliation": "Group of Applied Physics, University of Geneva"
            },
            {
                "first": "Robert",
                "last": "Thew",
                "affiliation": "Group of Applied Physics, University of Geneva"
            },
            {
                "first": "and Félix",
                "last": "Bussières",
                "affiliation": "ID Quantique SA"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 74,
        "title": "Asynchronous Measurement-Device-Independent Quantum Key Distribution with Local Frequency Reference",
        "abstract": "A post-measurement coincidence pairing technique is proposed to hold a repeater-like advantage and simultaneously mitigate the global phase tracking. Here, we demonstrate a practical asynchronous MDI-QKD system with an excellent long-term stability. With the use of two independent economical acetylene-stabilized fiber lasers, we achieve a secure key rate (SKR) of 14.65 bit/s over 504 km fiber, beating the absolute repeaterless bound by 1.18 times. Our work will advance the development of economical and efficient quantum network.",
        "authors": [
            {
                "first": "Chengfang",
                "last": "Ge",
                "affiliation": "Beijing Academy of Quantum Information Sciences"
            },
            {
                "first": "Lai",
                "last": "Zhou",
                "affiliation": "Beijing Academy of Quantum Information Sciences"
            },
            {
                "first": "Jinping",
                "last": "Lin",
                "affiliation": "Beijing Academy of Quantum Information Sciences"
            },
            {
                "first": "Hua-Lei",
                "last": "Yin",
                "affiliation": "Renmin University of China"
            },
            {
                "first": "Zhiliang",
                "last": "Yuan",
                "affiliation": "Beijing Academy of Quantum Information Sciences"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 76,
        "title": "The power of a single Haar random state: constructing and separating quantum pseudorandomness",
        "abstract": "In this work, we focus on the following question: what are the cryptographic implications of having access to an oracle that provides a single Haar random quantum state? We show, perhaps surprisingly, that such an oracle is sufficient to construct quantum pseudorandomness. Pseudorandom states (PRS) are a family of states for which it is hard to distinguish between polynomially many copies of either a state sampled uniformly from the family or a Haar random state. A weaker notion, called single-copy pseudorandom states (1PRS), satisfies this property with respect to a single copy. Our main result is that 1PRS (as well as bit-commitments) exist relative to an oracle that provides a single Haar random state. We build on this result to show the existence of an oracle relative to which 1PRS exist, but PRS do not. This provides one of the first black-box separations between different forms of quantum pseudorandomness.",
        "authors": [
            {
                "first": "Boyang",
                "last": "Chen",
                "affiliation": "Tsinghua University"
            },
            {
                "first": "Andrea",
                "last": "Coladangelo",
                "affiliation": "University of Washington"
            },
            {
                "first": "Or",
                "last": "Sattath",
                "affiliation": "Ben Gurion University of the Negev"
            }
        ],
        "topics": [
        ],
        "mergedwith": 125
    },
    {
        "pid": 81,
        "title": "MadQCI: a heterogeneous and scalable SDN QKD network deployed in production facilities.",
        "abstract": "Current quantum key distribution (QKD) networks focus almost exclusively on transporting secret keys with the highest possible rate. Consequently, they are built as mostly fixed, ad hoc, logically, and physically isolated infrastructures designed to avoid any penalty to the quantum channel. This architecture is neither scalable nor cost-effective and future, real-world deployments will differ considerably. The structure of the MadQCI QKD network presented here is based on disaggregated components and modern paradigms especially designed for flexibility, upgradability, and facilitating the integration of QKD in the security and telecommunications-networks ecosystem. These underlying ideas have been tested by deploying many QKD systems from several manufacturers in a real-world, multi-tenant telecommunications network, installed in production facilities and sharing the infrastructure with commercial traffic. Different technologies have been used in different links to address the variety of situations and needs that arise in real networks, exploring a wide range of possibilities. Finally, a set of realistic use cases have been implemented to demonstrate the validity and performance of the network. The testing took place during a period close to three years, where most of the nodes were continuously active.",
        "authors": [
            {
                "first": "Vicente",
                "last": "Martin",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "Juan Pedro",
                "last": "Brito",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "Laura",
                "last": "Ortiz",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "Ruben",
                "last": "Brito-Mendez",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "Jaime",
                "last": "Saez-Buruaga",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "Rafael J.",
                "last": "Vicente",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "Alberto",
                "last": "Sebastian-Lombraña",
                "affiliation": "Universidad Politécnica de Madrid / Center for computational simulation"
            },
            {
                "first": "David",
                "last": "Rincon",
                "affiliation": "IMDEA SW Institute"
            },
            {
                "first": "Cesar",
                "last": "Sanchez",
                "affiliation": "IMDEA SW institute"
            },
            {
                "first": "Fernando",
                "last": "Pérez",
                "affiliation": "IMDEA SW Institute"
            },
            {
                "first": "Momtchil",
                "last": "Peev",
                "affiliation": "Munich Research Center, Huawei Technologies Duesseldorf GmbH, Munich, Germany"
            },
            {
                "first": "Fred",
                "last": "Fung",
                "affiliation": "Munich Research Center, Huawei Technologies Duesseldorf GmbH, Munich, Germany"
            },
            {
                "first": "Hans H.",
                "last": "Brunner",
                "affiliation": "Munich Research Center, Huawei Technologies Duesseldorf GmbH, Munich, Germany"
            },
            {
                "first": "Andreas",
                "last": "Poppe",
                "affiliation": "Nutshell Quantum-Safe GmbH, Vienna, Austria"
            },
            {
                "first": "Florian",
                "last": "Frowis",
                "affiliation": "Nutshell Quantum-Safe GmbH, Vienna, Austria"
            },
            {
                "first": "Andrew J.",
                "last": "Shields",
                "affiliation": "Toshiba Europe Ltd., Cambridge, UK"
            },
            {
                "first": "Robert L.",
                "last": "Woodward",
                "affiliation": "Toshiba Europe Ltd., Cambridge, UK"
            },
            {
                "first": "Helmut",
                "last": "Griesser",
                "affiliation": "Adva Network Security GmbH. Berlin, Germany"
            },
            {
                "first": "Stefan",
                "last": "Roehrich",
                "affiliation": "Rohde & Schwarz Cybersecurity GmbH, Germany"
            },
            {
                "first": "Fernando De La",
                "last": "Iglesia",
                "affiliation": "Quside, Barcelona, Spain"
            },
            {
                "first": "Carlos",
                "last": "Abellán",
                "affiliation": "Quside, Barcelona, Spain"
            },
            {
                "first": "Michael",
                "last": "Hentschel",
                "affiliation": "Austrian Institute of Technology, Vienna, Austria"
            },
            {
                "first": "Jose Manuel",
                "last": "Rivas-Moscoso",
                "affiliation": "Telefónica gCTIO/I+D, Madrid, Spain"
            },
            {
                "first": "Antonio",
                "last": "Pastor-Perales",
                "affiliation": "Telefónica gCTIO/I+D, Madrid, Spain"
            },
            {
                "first": "Jesus",
                "last": "Folgueira",
                "affiliation": "Telefónica gCTIO/I+D, Madrid, Spain"
            },
            {
                "first": "Diego",
                "last": "López",
                "affiliation": "Telefónica gCTIO/I+D, Madrid, Spain"
            }
        ],
        "topics": [
        ],
        "mergedwith": 84
    },
    {
        "pid": 84,
        "title": "The largest quantum network of Europe in a node: Norte in MadQCI",
        "abstract": "During its fourth iteration, the Madrid Quantum Network (MadQCI) gathered up to 26 quantum key distribution (QKD) modules in 9 nodes connected by approximately 110 kilometres of fibre optic pairs. These nodes were part of two domains that had to be connected by an border link. It also hosted a co-located network testing a QKD-switched network. The deployment allowed quantum resources of different nature to be distributed and multiple use cases to be tested. This article details a single node in the network, called Norte, to exemplify the network deployment as a whole.",
        "authors": [
            {
                "first": "Alberto",
                "last": "Sebastián-Lombraña",
                "affiliation": "Universidad Politécnica de Madrid. Center for Computational Simulation"
            },
            {
                "first": "Juan Pedro Brito",
                "last": "Mendez",
                "affiliation": "Universidad Politécnica de Madrid"
            },
            {
                "first": "Rubén B.",
                "last": "Méndez",
                "affiliation": "Universidad Politécnica de Madrid. Center for Computational Simulation"
            },
            {
                "first": "Rafael J",
                "last": "Vicente",
                "affiliation": "Universidad Politécnica de Madrid. Center for Computational Simulation"
            },
            {
                "first": "Jaime S.",
                "last": "Buruaga",
                "affiliation": "Universidad Politécnica de Madrid. Center for Computational Simulation"
            },
            {
                "first": "Laura",
                "last": "Ortiz",
                "affiliation": "Universidad Politécnica de Madrid. Center for Computational Simulation"
            },
            {
                "first": "Vicente",
                "last": "Martin-Ayuso",
                "affiliation": "Universidad Politécnica de Madrid"
            }
        ],
        "topics": [
        ],
        "mergedwith": 81
    },
    {
        "pid": 89,
        "title": "Spanning tree packing algorithm for conference secret key propagation and GHZ distillation",
        "abstract": "Networks of nodes connected by pairwise quantum key distribution (QKD) links are actively developing now. We consider the following problem: Given pairwise secret keys from QKD, how to agree on a common (conference) key for the whole network using classical communication? We propose an algorithm based on spanning tree packing from the graph theory and prove its optimality. The same algorithm can be applied for the GHZ distillation in pair-entangled networks.",
        "authors": [
            {
                "first": "Anton",
                "last": "Trushechkin",
                "affiliation": "Heinrich Heine University Düsseldorf"
            },
            {
                "first": "Justus",
                "last": "Neumann",
                "affiliation": "Heinrich Heine University Düsseldorf"
            },
            {
                "first": "Hermann",
                "last": "Kampermann",
                "affiliation": "Heinrich Heine University Düsseldorf"
            },
            {
                "first": "Dagmar",
                "last": "Bruss",
                "affiliation": "Heinrich Heine University Düsseldorf"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 90,
        "title": "Quantum Key Leasing for PKE and FHE with a Classical Lessor",
        "abstract": "In this work, we consider the problem of secure key leasing, also known as revocable cryptography (Agarwal et. al. Eurocrypt' 23, Ananth et. al. TCC' 23), as a strengthened security notion to its predecessor put forward in Ananth et. al. (Eurocrypt' 21). This problem aims to leverage unclonable nature of quantum information to allow a lessor to lease a quantum key with reusability for evaluating a classical functionality. Later, the lessor can request the lessee to provably delete the key and then the lessee will be completely deprived of the capability to evaluate. In this work, we construct a secure key leasing scheme to lease a decryption key of a (classical) public-key, homomorphic encryption scheme from standard lattice assumptions. Our encryption scheme is exactly identical to the (primal) version of Gentry-Sahai-Waters homomorphic encryption scheme with a carefully chosen public key matrix. We achieve strong form of security where: The entire protocol (including key generation and verification of deletion)  uses merely classical communication between a classical lessor (client) and a quantum lessee (server). Assuming standard assumptions, our security definition ensures that every computationally bounded quantum adversary could only simultaneously provide a valid classical deletion certificate and yet distinguish ciphertexts with at most some negligible probability. Our security relies on subexponential time hardness of learning with errors assumption. Our scheme is the first scheme to be based on a standard assumption and satisfying the two properties mentioned above. The main technical novelty in our work is the design of an FHE scheme that enables us to apply elegant analyses done in the context of classical verification of quantumness from LWE (Brakerski et. al.(FOCS'18, JACM'21) and its parallel amplified version in Radian et. al.(AFT'21)) to the setting of secure leasing. This connection to classical verification of quantumness leads to a modular construction and arguably simpler proofs than previously known. An important technical component we prove along the way is an amplified quantum search-to-decision reduction: we design an extractor that uses a quantum distinguisher (who has an internal quantum state) for decisional LWE, to extract secrets with success probability amplified to almost one. This technique might be of independent interest.",
        "authors": [
            {
                "first": "Orestis",
                "last": "Chardouvelis",
                "affiliation": "Carnegie Mellon University"
            },
            {
                "first": "Vipul",
                "last": "Goyal",
                "affiliation": "NTT Research, Carnegie Mellon University"
            },
            {
                "first": "Aayush",
                "last": "Jain",
                "affiliation": "Carnegie Mellon University"
            },
            {
                "first": "Jiahui",
                "last": "Liu",
                "affiliation": "Massachusetts Institute of Technology"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 91,
        "title": "Twin Field Quantum Key Distribution Across National Scale Telecommunication Infrastructure",
        "abstract": "Quantum Communications (QC) harness quantum mechanical phenomena such as superposition and entanglement to enhance information transfer between remote nodes. Coherent quantum communications refer to QC schemes relying on maintaining optical coherence between nodes for successful execution. These schemes typically involve single photon interference between optical fields generated by distant parties and represent a cornerstone of a promising architecture of the quantum internet. Despite their significant potential, scientific and technical hurdles - including optical coherence maintenance, integrating high-performance single-photon detectors, and precise stabilisation and synchronisation - have prevented the implementation of coherent QC over existing telecommunication infrastructure. Here we present the first realisation of a coherent QC fully integrated into standard telecommunication infrastructure over a link connecting the German cities of Frankfurt and Kehl. The implemented scheme is the Twin Field Quantum Key Distribution (QKD) protocol, enabling the distribution of a shared secret key for encryption at a rate of 110 bit/s over a highly asymmetric 254 km link. This result, obtained with a system featuring measurement-device-independent properties, marks the longest installed QKD implementation utilising non-cryogenic cooled detectors and was enabled by the QC system architecture we developed and by our approach to phase stabilisation, which involves active out-of-band phase stabilisation and avalanche photodiodes for single photon detection. This achievement, not only represents a milestone for practical quantum communications but also validates the compatibility of coherent QC with current telecommunication infrastructure, supporting the feasibility of a phase-based architecture for the quantum internet.",
        "authors": [
            {
                "first": "Mirko",
                "last": "Pittaluga",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "Yuen San",
                "last": "Lo",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "Adam",
                "last": "Brzosko",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "Robert I.",
                "last": "Woodward",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "Matthew S.",
                "last": "Winnel",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "Thomas",
                "last": "Roger",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "James F.",
                "last": "Dynes",
                "affiliation": "Toshiba Europe Ltd"
            },
            {
                "first": "Piotr",
                "last": "Rydlichowski",
                "affiliation": "Poznan Supercomputing and Networking Center"
            },
            {
                "first": "Domenico",
                "last": "Vicinanza",
                "affiliation": "GEANT Vereniging"
            },
            {
                "first": "Guy",
                "last": "Roberts",
                "affiliation": "GEANT Vereniging"
            },
            {
                "first": "Andrew J.",
                "last": "Shields",
                "affiliation": "Toshiba Europe Ltd"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 96,
        "title": "Lower bounds on entanglement and quantum gates in non-local quantum computation",
        "abstract": "A non-local quantum computation (NLQC) replaces an interaction between two quantum systems with a single simultaneous round of communication and shared entanglement. We study two classes of NLQC, f-routing and f-BB84. These are well studied in the context of position-verification, where they are leading candidates for feasible and secure verification schemes. Both settings require an honest prover implement only O(1) quantum operations. We prove that a dishonest prover must use linear quantum resources to attack the same scheme. First, we give the first non-trivial lower bounds on entanglement in both settings, but are restricted to lower bounding protocols with perfect correctness. Our bound can be stated in terms of the quantum non-deterministic communication complexity of f. For the equality, non-equality, and greater-than functions we obtain linear lower bounds on entanglement for f-routing and f-BB84 in the perfect setting. In a second result, which applies in the robust setting, we give a new lower bound on the number of quantum gates and measurements needed to attack these verification schemes. We lower bound the gates plus measurements linearly in the simultaneous message passing cost of the function f. This leads to a linear bound against the inner product function. This gives a clear separation between the difficulty of implementing these tasks in the honest and dishonest settings, and does so in a noise robust and loss tolerant setting.",
        "authors": [
            {
                "first": "Alex",
                "last": "May",
                "affiliation": "Perimeter Institute for Theoretical Physics"
            },
            {
                "first": "Vahid Reza",
                "last": "Asadi",
                "affiliation": "University of Waterloo"
            },
            {
                "first": "Eric",
                "last": "Culf",
                "affiliation": "University of Waterloo"
            },
            {
                "first": "Richard",
                "last": "Cleve",
                "affiliation": "University of Waterloo"
            }
        ],
        "topics": [
        ],
        "mergedwith": 20
    },
    {
        "pid": 101,
        "title": "The Quantum Decoherence Model: Everlasting Commitments and Quantum Incompressible Encryption",
        "abstract": "Quantum cryptography allows to achieve security goals that are unobtainable using classical cryptography alone, it offers the promise of everlasting privacy. That is, an adversary trying to attack a protocol must succeed during the run of the protocol, after the protocol has terminated security holds unconditionally. In this work we initiate the study of a new model which we call the quantum decoherence model (QDM). In a nutshell, this model requires that the adversary is computationally bounded during the run of a protocol (and some time after), but becomes computationally unbounded long after the protocol terminates. Importantly, once the adversary becomes computationally unbounded, he can only remember a bounded number of qubits from before the bound was lifted. As our main contribution, we construct a non-interactive commitment scheme achieving unconditional security against malicious senders and everlasting security against malicious receivers in the UC model. Additionally, we show that it gives rise to everlasting public key encryption and OT in the QDM. Finally, we also consider the weaker notion of incompressible encryption in the setting of quantum decoherence, and show that post-quantum IND-CPA secure public key encryption is sufficient to realize this notion without resorting to random oracles.",
        "authors": [
            {
                "first": "Anne",
                "last": "Müller",
                "affiliation": "CISPA - Helmholtz Center for Information Security"
            },
            {
                "first": "Nico",
                "last": "Döttling",
                "affiliation": "CISPA - Helmholtz Center for Information Security"
            },
            {
                "first": "Sven",
                "last": "Maier",
                "affiliation": "KASTEL Security Research Labs, Karlsruhe Institute of Technology"
            },
            {
                "first": "Marcel",
                "last": "Tiepelt",
                "affiliation": "KASTEL Security Research Labs, Karlsruhe Institute of Technology"
            },
            {
                "first": "Alexander",
                "last": "Koch",
                "affiliation": "CNRS, IRIF, Université Paris Cité"
            },
            {
                "first": "Jörn",
                "last": "Müller-Quade",
                "affiliation": "KASTEL Security Research Labs, Karlsruhe Institute of Technology"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 107,
        "title": "The Rio Quantum Network: towards a reconfigurable hybrid metropolitan QKD network",
        "abstract": "This work introduces a metropolitan quantum communication network connecting four research institutions in the state of Rio de Janeiro through installed dark optical fibers and a 7-km free space link. The Twin-Field Measurement Device Independent Quantum Key Distribution (TF-MDI-QKD) protocol is implemented to enable secure communication between any two network nodes independently, without the need for trusted nodes. The proposed structured - a \"folded Sagnac\" configuration - is shown to be able to not only automatically compensate for phase fluctuations but also circumvent unneeded losses by reconfiguring the Sagnac loop size as needed; moreover, by employing polarization control and a Faraday Mirror, the free-space link can be added to the loop without the need for additional telescopes. The first experimental results will be presented together with the main engineering challenges being tackled.",
        "authors": [
            {
                "first": "Guilherme",
                "last": "Temporao",
                "affiliation": "Pontifical Catholic University of Rio de Janeiro (PUC-Rio"
            },
            {
                "first": "Fernando",
                "last": "Melo",
                "affiliation": "Centro Brasileiro de Pesquisas Físicas"
            },
            {
                "first": "Antonio",
                "last": "Khoury",
                "affiliation": "Universidade Federal Fluminense"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 109,
        "title": "Quantum One-Wayness of the Single-Round Sponge with Invertible Permutations",
        "abstract": "Sponge hashing is a widely used class of cryptographic hash algorithms which underlies the current international hash function standard SHA-3. In a nutshell, a sponge function takes as input a bit-stream of any length and processes it via a simple iterative procedure: it repeatedly feeds each block of the input into a so-called block function, and then produces a digest by once again iterating the block function on the final output bits. While much is known about the post-quantum security of the sponge construction in the case when the block function is modeled as a random function or one-way permutation, the case of permutations allowing inverse queries, which more accurately models the construction underlying SHA-3, has so far remained a fundamental open problem. In this work, we make new progress towards overcoming this barrier and show several results. First, we prove the “double-sided zero-search” conjecture proposed by Unruh (eprint’ 2021) and show that finding zero-pairs in a random 2n-bit permutation requires at least Ω(2^n/2) many queries—and this is tight due to Grover’s algorithm. At the core of our proof lies a novel “symmetrization argument” which uses insights from the theory of Young subgroups. Second, we consider more general variants of the double-sided search problem and show similar query lower bounds for them. As an application, we prove the quantum one-wayness of the single-round sponge with invertible permutations in the quantum random permutation model.",
        "authors": [
            {
                "first": "Joseph",
                "last": "Carolan",
                "affiliation": "University of Maryland"
            },
            {
                "first": "Alexander",
                "last": "Poremba",
                "affiliation": "MIT"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 110,
        "title": "Mutual information chain rules for security proofs robust against device imperfections",
        "abstract": "In this work we derive a number of chain rules for mutual information quantities, suitable for analyzing quantum cryptography with imperfect devices that leak additional information to an adversary. First, we derive a chain rule between smooth min-entropy and smooth max-information, which improves over previous chain rules for characterizing one-shot information leakage caused by an additional conditioning register. Second, we derive an information accumulation theorem that bounds the Rényi mutual information of a state produced by a sequence of channels, in terms of the Rényi mutual information of the individual channel outputs. In particular, this yields simple bounds on the smooth max-information in the preceding chain rule. Third, we derive chain rules between Rényi entropies and Rényi mutual information, which can be used to modify the entropy accumulation theorem to accommodate leakage registers sent to the adversary in each round of a protocol. We show that these results can be used to handle some device imperfections in a variety of device-dependent and device-independent protocols, such as randomness generation and quantum key distribution.",
        "authors": [
            {
                "first": "Amir",
                "last": "Arqand",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo"
            },
            {
                "first": "Tony",
                "last": "Metger",
                "affiliation": "Institute for Theoretical Physics, ETH Zurich"
            },
            {
                "first": "and Ernest Y.-Z.",
                "last": "Tan",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 111,
        "title": "Experimental Sample-Efficient Device-Independent Verification and Certification of a 4-qubit GHZ state",
        "abstract": "Authentication of quantum resources is a critical tool in the development of quantum information processing protocols. In particular, the verification of quantum states is often used as a building block for communication tasks, determining whether the communicating parties can trust the resources at hand to exchange information or whether the protocol should be aborted. Self-testing methods have been used to tackle such verification tasks in a device-independent (DI) scenario. However, these approaches commonly consider the limit of large, identically and independently distributed (IID) samples, which weakens the DI claim and poses serious challenges to their experimental implementation. To address these issues, Gocanin et al. [1] developed a protocol to certify quantum states in the few-copies and non-IID regime. In this work, we adopt their protocol to experimentally demonstrate the device-independent verification of a four-photon GHZ state, produced with our compact and high-fidelity multipartite entangled photon source.",
        "authors": [
            {
                "first": "Laura dos Santos",
                "last": "Martins",
                "affiliation": "LIP6 - Sorbonne Université"
            },
            {
                "first": "Nicolas",
                "last": "Laurent-Puig",
                "affiliation": "LIP6 - Sorbonne Université"
            },
            {
                "first": "Ivan",
                "last": "Šupić",
                "affiliation": "LIP6 - Sorbonne Université"
            },
            {
                "first": "Pascal",
                "last": "Lefebvre",
                "affiliation": "LIP6 - Sorbonne Université"
            },
            {
                "first": "Damian",
                "last": "Markham",
                "affiliation": "LIP6 - Sorbonne Université"
            },
            {
                "first": "and Eleni",
                "last": "Diamanti",
                "affiliation": "LIP6 - Sorbonne Université"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 117,
        "title": "Unconditionally Secure Commitments with Quantum Auxiliary Inputs",
        "abstract": "We show the following unconditional results on quantum commitments in two related yet different models: 1. We revisit the notion of quantum auxiliary-input commitments introduced by Chailloux, Kerenidis, and Rosgen (Comput. Complex. 2016) where  both the committer and receiver take the same quantum state, which is determined by the security parameter, as quantum auxiliary inputs. We show that computationally-hiding and statistically-binding quantum auxiliary-input commitments exist unconditionally, i.e., without relying on any unproven assumption, while Chailloux et al. assumed a complexity-theoretic assumption, $QIP not subseteq QMA$. On the other hand, we observe that achieving both statistical hiding and statistical binding at the same time is impossible even in the quantum auxiliary-input setting. To the best of our knowledge, this is the first example of unconditionally proving computational security of any form of (classical or quantum) commitments  for which statistical security is impossible. As intermediate steps toward our construction, we introduce and unconditionally construct post-quantum sparse pseudorandom distributions and quantum auxiliary-input EFI pairs which may be of independent interest. 2. We introduce a new model which we call the common reference quantum state (CRQS) model where both the committer and receiver take the same quantum state that is randomly sampled by an efficient setup algorithm. We unconditionally prove that there exist statistically hiding and statistically binding commitments in the CRQS model, circumventing the impossibility in the plain model. We also discuss their applications to zero-knowledge proofs, oblivious transfers, and multi-party computations.",
        "authors": [
            {
                "first": "Tomoyuki",
                "last": "Morimae",
                "affiliation": "Yukawa Institute for Theoretical Physics, Kyoto University, Kyoto, Japan"
            },
            {
                "first": "Barak",
                "last": "Nehoran",
                "affiliation": "Princeton University, Princeton, NJ"
            },
            {
                "first": "and Takashi",
                "last": "Yamakawa",
                "affiliation": "NTT Social Informatics Laboratories, Tokyo, Japan"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 121,
        "title": "Commitments are equivalent to one-way state generators",
        "abstract": "One-way state generators (OWSG) [MY22a] are natural quantum analogs to classical one-way functions. We show that O(n/log(n))-copy OWSGs (n represents the input length) are equivalent to poly(n)-copy OWSGs and to quantum commitments. Since known results show that o(n/log(n))-copy OWSGs cannot imply commitments [CGG`23], this shows that O(n/log(n))-copy OWSGs are the weakest OWSGs from which we can get commitments (and hence much of quantum cryptography). Our construction follows along the lines of Håstad, Impagliazzo, Levin and Luby [HILL99], who obtained classical pseudorandom generators (PRG) from classical one-way functions (OWF), however with crucial modifications. Our construction, when applied to the classical case, provides an alternative to the construction provided by [HILL99]. Since we do not argue conditioned on the output of the one-way function, our construction and analysis are arguably simpler and may be of independent interest.",
        "authors": [
            {
                "first": "Rishabh",
                "last": "Batra",
                "affiliation": "CQT, NUS"
            },
            {
                "first": "Rahul",
                "last": "Jain",
                "affiliation": "CQT, NUS"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 124,
        "title": "Finite-size decoy-state security proof against coherent attacks",
        "abstract": "Proving the security of quantum key distribution (QKD) protocols against arbitrary attacks is a challenging task for arbitrary protocols. Here, we accomplish this task by extending and improving both the decoy-state analysis against collective attacks, and the postselection technique to uplift this security proof to arbitrary attacks. First, we improve the postselection technique - both by improving the cost paid for the uplift, and by rigorously showing how it can be applied to generic optical protocols. Second, we fundamentally improve the decoy-state analysis in such a way that we require only one decoy intensity to achieve the same performance as prior analysis with two decoy intensities. This has two consequences - it makes the protocol easier to practically implement, and reduces the penalty incurred by using the postselection technique. Third, we extend the finite-size QKD analysis to decoy-state protocols and generically improve the finite-size correction terms that appear. Thus, we provide a full security proof against arbitrary attacks for generic decoy-state protocols.",
        "authors": [
            {
                "first": "Shlok",
                "last": "Nahar",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo"
            },
            {
                "first": "Lars",
                "last": "Kamin",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo"
            },
            {
                "first": "Devashish",
                "last": "Tupkary",
                "affiliation": "Institute for Quantum Computing"
            },
            {
                "first": "Yuming",
                "last": "Zhao",
                "affiliation": "Institute for Quantum Computing and Department of Pure Mathematics, University of Waterloo"
            },
            {
                "first": "Ernest Y.-Z.",
                "last": "Tan",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo"
            },
            {
                "first": "and Norbert",
                "last": "Lütkenhaus",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 125,
        "title": "On Pseudorandomness in the Common Haar State Model",
        "abstract": "Common random string model is a popular model in classical cryptography with many constructions proposed in this model. We study a quantum analogue of this model called the common Haar state model, which was also studied in an independent work by Chen, Coladangelo and Sattath (arXiv 2024). In this model, every party in the cryptographic system receives many copies of one or more i.i.d Haar states. Our main result is the construction of a statistically secure pseudorandom function-like state generator (PRFSG) in the common Haar state model. Our construction satisfies stretch property (output length > $\\lambda$), can handle inputs of length  $\\lambda^{c}$ and is secure as long as the adversary gets $O\\left(\\frac{\\lambda^{1-c}}{(\\log(\\lambda))^{1.01}} \\right)$ number of queries, where $\\lambda$ is the length of the PRFSG key and $c \\in [0,1)$. We show the optimality of our construction by proving a matching lower bound. As a consequence, for the first time, we show that (computationally secure) PRFSGs for super-logarithmic input length can be constructed from (computationally secure) pseudorandom state generators in some parameter regimes.",
        "authors": [
            {
                "first": "Prabhanjan",
                "last": "Ananth",
                "affiliation": "University of California, Santa Barbara"
            },
            {
                "first": "Aditya",
                "last": "Gulati",
                "affiliation": "University of California, Santa Barbara"
            },
            {
                "first": "Yao-Ting",
                "last": "Lin",
                "affiliation": "University of California, Santa Barbara"
            }
        ],
        "topics": [
        ],
        "mergedwith": 76
    },
    {
        "pid": 126,
        "title": "Succinct arguments for QMA from standard assumptions via compiled nonlocal games",
        "abstract": "We construct a succinct classical argument system for QMA, the quantum analogue of NP, from generic and standard cryptographic assumptions. Previously, building on the prior work of Mahadev (FOCS '18), Bartusek et al. (CRYPTO '22) also constructed a succinct classical argument system for QMA. However, their construction relied on  post-quantumly secure indistinguishability obfuscation, a very strong primitive which is not known from standard cryptographic assumptions. In contrast, the primitives we use (namely, collapsing hash functions and a mild version of quantum homomorphic encryption) are much weaker and are implied by standard assumptions such as LWE. Our protocol is constructed using a general transformation which was designed by Kalai et al. (STOC '23) as a candidate method to compile any quantum nonlocal game into an argument system. Our main technical contribution is to analyze the soundness of this transformation when it is applied to a succinct self-test for Pauli measurements on maximally entangled states, the latter of which is a key component in the proof of MIP* = RE in quantum complexity.",
        "authors": [
            {
                "first": "Tony",
                "last": "Metger",
                "affiliation": "ETH Zurich"
            },
            {
                "first": "Anand",
                "last": "Natarajan",
                "affiliation": "MIT"
            },
            {
                "first": "Tina",
                "last": "Zhang",
                "affiliation": "MIT"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 129,
        "title": "Simple constructions of linear-depth t-designs and pseudorandom unitaries",
        "abstract": "Uniformly random unitaries, i.e. unitaries drawn from the Haar measure, have many useful properties but cannot be implemented efficiently. This has motivated a long line of research into random unitaries that ``look'' sufficiently Haar random while also being efficient to implement. Two different notions of derandomisation have emerged: t-designs are random unitaries that information-theoretically reproduce the first t moments of the Haar measure, and pseudorandom unitaries (PRUs) are random unitaries that are computationally indistinguishable from Haar random.In this work, we take a unified approach to constructing t-designs and PRUs. For this, we introduce and analyse the ``PFC ensemble'', the product of a computational basis permutation P, a random binary phase operator F, and a random Clifford unitary C. We show that this ensemble reproduces exponentially high moments of the Haar measure. We can then derandomise the PFC ensemble to show the following:-Linear-depth t-designs. We give the first construction of a (diamond-error) approximate t-design with circuit depth linear in t. This follows from the PFC ensemble by replacing the random phase and permutation operators with their 2t-wise independent counterparts. - Non-adaptive PRUs.  We give the first construction of PRUs with non-adaptive security, i.e. we construct unitaries that are indistinguishable from Haar random to polynomial-time distinguishers that query the unitary in parallel on an arbitary state. This follows from the PFC ensemble by replacing the random phase and permutation operators with their pseudorandom counterparts. - Adaptive pseudorandom isometries. We show that if one considers isometries (rather than unitaries) from n to n + \\omega(log n) qubits, a small modification of our PRU construction achieves adaptive security, i.e.~even a distinguisher that can query the isometry adaptively in sequence cannot distinguish it from Haar random isometries. This gives the first construction of adaptive pseudorandom isometries. Under an additional conjecture, this proof also extends to adaptive PRUs.",
        "authors": [
            {
                "first": "Tony",
                "last": "Metger",
                "affiliation": "ETH Zurich"
            },
            {
                "first": "Alexander",
                "last": "Poremba",
                "affiliation": "MIT"
            },
            {
                "first": "Makrand",
                "last": "Sinha",
                "affiliation": "UIUC"
            },
            {
                "first": "Henry",
                "last": "Yuen",
                "affiliation": "Columbia University"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 133,
        "title": "Heralded entanglement of solid-state qubits at metropolitan scale",
        "abstract": "We present a deployed quantum link between the Dutch cities Delft and The Hague separated by 10 kilometers, capable of generating solid-state heralded entanglement. This link is realized by employing NV center end nodes, connecting them with state-of-the-art Quantum Frequency Converters and a phase-stabilized architecture over 25 kilometers of telecom fiber. By capitalizing on the full heralding capabilities of the network link in combination with real-time feedback logic on the long-lived qubits, we demonstrate the delivery of a predefined entangled state on the nodes irrespective of the detector outcome. The extendable design, real-time control and compatibility with other qubit platforms and makes this architecture an excellent candidate for future metropolitan scale quantum networks.",
        "authors": [
            {
                "first": "Arian",
                "last": "Stolk",
                "affiliation": "QuTech, Delft University of Technology"
            },
            {
                "first": "Kian van der",
                "last": "Enden",
                "affiliation": "QuTech, Delft University of Technology"
            },
            {
                "first": "Marie-Christine",
                "last": "Slater",
                "affiliation": "AIT Austrian Institute of Technology GmbH"
            },
            {
                "first": "Ingmar te",
                "last": "Raa-Derckx",
                "affiliation": "QuTech, Delft University of Technology"
            },
            {
                "first": "Pieter",
                "last": "Botmar",
                "affiliation": "QuTech, Delft University of Technology"
            },
            {
                "first": "Joris van",
                "last": "Rantwijk",
                "affiliation": "QuTech, Delft University of Technology"
            },
            {
                "first": "Benjamin",
                "last": "Biemond",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "Ronald",
                "last": "Hagen",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "Rodolf",
                "last": "Herfst",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "Wouter",
                "last": "Koek",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "Arjan",
                "last": "Meskers",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "René",
                "last": "Vollmer",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "Erwin van",
                "last": "Zwet",
                "affiliation": "Netherlands Organisation for Applied Scientific Research (TNO"
            },
            {
                "first": "Matthew",
                "last": "Markham",
                "affiliation": "Element Six Innovation"
            },
            {
                "first": "Andrew",
                "last": "Edmonds",
                "affiliation": "Element Six Innovation"
            },
            {
                "first": "Fabian",
                "last": "Geus",
                "affiliation": "Fraunhofer Institute for Laser Technology ILT"
            },
            {
                "first": "Florian",
                "last": "Elsen",
                "affiliation": "Fraunhofer Institute for Laser Technology ILT"
            },
            {
                "first": "Bernd",
                "last": "Jungbluth",
                "affiliation": "Fraunhofer Institute for Laser Technology ILT"
            },
            {
                "first": "Constantin",
                "last": "Haefner",
                "affiliation": "Fraunhofer Institute for Laser Technology ILT"
            },
            {
                "first": "Christoph",
                "last": "Tresp",
                "affiliation": "TOPTICA Photonics AG"
            },
            {
                "first": "Jürgen",
                "last": "Stuhler",
                "affiliation": "TOPTICA Photonics AG"
            },
            {
                "first": "Stephan",
                "last": "Ritter",
                "affiliation": "TOPTICA Photonics AG"
            },
            {
                "first": "and Ronald",
                "last": "Hanson",
                "affiliation": "QuTech, Delft University of Technology"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 136,
        "title": "Composable discrete-modulated continuous-variable QKD and its application to urban atmospheric channels",
        "abstract": "In our work, we developed an optical CVQKD system that uses polarization-based QPSK modulation designed for atmospheric quantum communication and a corresponding post-processing pipeline including error correction and privacy amplification. In a first laboratory experiment, we applied the security statement of a recently published security proof to calculate composable key rates with a total security parameter of ε = 1e-10 in the finite size regime against i.i.d. collective attacks. We also used the post-processing pipeline to study the effect of error correction and frame errors on the actual key extraction in a finite-size system – finding that the common approach of going to high frame errors to increase the ECC efficiency β does not optimize the extractable key length.Furthermore, we deployed the system over an ad-hoc atmospheric channel of 1.7 km in Mai 2023 in the city of Jena, Germany. In a first proof-of-principle study, we were able to apply the full optical and post-processing pipeline to extract pseudo-asymptotic keys and discuss the further steps necessary to move the system to the finite-size regime. To the best of our knowledge, this is the first CVQKD demonstration over a real atmospheric channel combining both the new class of DMCVQKD security proofs without Gaussian optimality and error correction steps.",
        "authors": [
            {
                "first": "Kevin",
                "last": "Jaksch",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Thomas",
                "last": "Dirmeier",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Jan",
                "last": "Schreck",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Yannick",
                "last": "Weiser",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Stefan",
                "last": "Richter",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Ömer",
                "last": "Bayraktar",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Bastian",
                "last": "Hacker",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Conrad",
                "last": "Rößler",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Imran",
                "last": "Khan",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "Andrej",
                "last": "Krzic",
                "affiliation": "Fraunhofer Institute for Applied Optics and Precision Engineering, Jena, Germany"
            },
            {
                "first": "Markus",
                "last": "Rothe",
                "affiliation": "Fraunhofer Institute for Applied Optics and Precision Engineering, Jena, Germany"
            },
            {
                "first": "Markus",
                "last": "Leipe",
                "affiliation": "Fraunhofer Institute for Applied Optics and Precision Engineering, Jena, Germany"
            },
            {
                "first": "Nico",
                "last": "Döll",
                "affiliation": "Fraunhofer Institute for Applied Optics and Precision Engineering, Jena, Germany"
            },
            {
                "first": "Christopher",
                "last": "Spiess",
                "affiliation": "Fraunhofer Institute for Applied Optics and Precision Engineering, Jena, Germany"
            },
            {
                "first": "Matthias",
                "last": "Goy",
                "affiliation": "Fraunhofer Institute for Applied Optics and Precision Engineering, Jena, Germany"
            },
            {
                "first": "Stefan",
                "last": "Petscharning",
                "affiliation": "Austrian Institute of Technology, Center for Digital Safety&Security, Vienna, Austria"
            },
            {
                "first": "Thomas",
                "last": "Grafenauer",
                "affiliation": "Austrian Institute of Technology, Center for Digital Safety&Security, Vienna, Austria"
            },
            {
                "first": "Bernhard",
                "last": "Ömer",
                "affiliation": "Austrian Institute of Technology, Center for Digital Safety&Security, Vienna, Austria"
            },
            {
                "first": "Christoph",
                "last": "Pacher",
                "affiliation": "Austrian Institute of Technology, Center for Digital Safety&Security, Vienna, Austria"
            },
            {
                "first": "Florian",
                "last": "Kanitschar",
                "affiliation": "Austrian Institute of Technology, Center for Digital Safety&Security, Vienna, Austria"
            },
            {
                "first": "Twesh",
                "last": "Upadhyaya",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Canada"
            },
            {
                "first": "Jie",
                "last": "Lin",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Canada"
            },
            {
                "first": "Norbert",
                "last": "Lütkenhaus",
                "affiliation": "Institute for Quantum Computing and Department of Physics and Astronomy, University of Waterloo, Canada"
            },
            {
                "first": "Gerd",
                "last": "Leuchs",
                "affiliation": "Max Planck Institute for the Science of Light, Erlangen, Germany"
            },
            {
                "first": "and Christoph",
                "last": "Marquardt",
                "affiliation": "Department of Physics, Friedrich-Alexander-Universität Erlangen-Nürnberg, Germany"
            }
        ],
        "topics": [
        ]
    },
    {
        "pid": 141,
        "title": "QUBE - A CubeSat mission to demonstrate new building blocks for satellite based quantum key distribution",
        "abstract": "The CubeSat mission QUBE aims to evaluate novel, miniaturized Quantum Key Distribution (QKD) building blocks in space including an optical downlink to an optical ground station. The mission will be launched in July 2024 and will provide important insights into new technology which potentially could form the backbone of a cost-effective satellite based QKD system on a global scale.",
        "authors": [
            {
                "first": "Jonas",
                "last": "Pudelko",
                "affiliation": "Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU)"
            },
            {
                "first": "Michael",
                "last": "Auer",
                "affiliation": "Ludwig Maximilian University (LMU)"
            },
            {
                "first": "Adomas",
                "last": "Baliuka",
                "affiliation": "Ludwig Maximilian University (LMU)"
            },
            {
                "first": "Ömer",
                "last": "Bayraktar",
                "affiliation": "Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU)"
            },
            {
                "first": "Moritz",
                "last": "Birkhold",
                "affiliation": "Ludwig Maximilian University (LMU)"
            },
            {
                "first": "Peter",
                "last": "Freiwang",
                "affiliation": "Ludwig Maximilian University (LMU)"
            },
            {
                "first": "Matthias",
                "last": "Grünefeld",
                "affiliation": "OHB System AG"
            },
            {
                "first": "Roland",
                "last": "Haber",
                "affiliation": "Center for Telematics (ZfT)"
            },
            {
                "first": "Martin",
                "last": "Hutterer",
                "affiliation": "OHB System AG"
            },
            {
                "first": "Janko",
                "last": "Janusch",
                "affiliation": "OHB System AG"
            },
            {
                "first": "Imran",
                "last": "Khan",
                "affiliation": "Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU)"
            },
            {
                "first": "Lukas",
                "last": "Knips",
                "affiliation": "Ludwig Maximilian University (LMU)"
            },
            {
                "first": "Norbert",
                "last": "Lemke",
                "affiliation": "OHB System AG"
            },
            {
                "first": "Christoph",
                "last": "Marquardt",
                "affiliation": "Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU)"
            },
            {
                "first": "Florian",
                "last": "Moll",
                "affiliation": "German Aerospace Center (DLR)"
            },
            {
                "first": "Benjamin",
                "last": "Rödiger",
                "affiliation": "German Aerospace Center (DLR)"
            },
            {
                "first": "Klaus",
                "last": "Schilling",
                "affiliation": "Center for Telematics (ZfT)"
            },
            {
                "first": "Christopher",
                "last": "Schmidt",
                "affiliation": "German Aerospace Center (DLR)"
            },
            {
                "first": "Bhardwaj",
                "last": "Shastri",
                "affiliation": "Center for Telematics (ZfT)"
            },
            {
                "first": "Michael",
                "last": "Steinberger",
                "affiliation": "Ludwig Maximilian University (LMU"
            },
            {
                "first": "Karina",
                "last": "Szych",
                "affiliation": "OHB System AG"
            },
            {
                "first": "Joost",
                "last": "Vermeer",
                "affiliation": "Friedrich-Alexander-Universität Erlangen-Nürnberg (FAU"
            },
            {
                "first": "Paul",
                "last": "Wagner",
                "affiliation": "German Aerospace Center (DLR IKN) "
            },
            {
                "first": "Harald",
                "last": "Weinfurter",
                "affiliation": "Ludwig Maximilian University (LMU"
            }
        ],
        "topics": [
        ]
    }
]